Revit 2026 API

# HermiteSplineCreate(IListXYZ, Boolean, HermiteSplineTangents) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static HermiteSpline Create(
	IList<XYZ> controlPoints,
	bool periodic,
	HermiteSplineTangents tangents
)
```
```vb
Public Shared Function Create (
	controlPoints As IList(Of XYZ),
	periodic As Boolean,
	tangents As HermiteSplineTangents
) As HermiteSpline
```
```cpp
public:
static HermiteSpline^ Create(
	IList<XYZ^>^ controlPoints,
	bool periodic,
	HermiteSplineTangents^ tangents
)
```
```fsharp
static member Create :
        controlPoints : IList<XYZ> *
        periodic : bool *
        tangents : HermiteSplineTangents -> HermiteSpline
```

#### Parameters

controlPoints IListXYZ

periodic Boolean

tangents HermiteSplineTangents

#### Return Value

HermiteSpline

#### Reference

HermiteSpline Class

Create Overload

Autodesk.Revit.DB Namespace